
## 재배기술 외 QnA 프롬프트 (키워드 검색)
prompt = ChatPromptTemplate.from_template(f"""
        [참고 자료]
        {{context}}

        [사용자 질문]
        {{input}}

        [지시 사항]
        1. 너는 농작물 관련 
        2. 아래 사용자 질문에 대해 참고자료를 기반으로 대답해 줘.
        3. 문제는 반드시 "{question_type}" 형식으로 만들어줘.
        4. 각 문제에는 "문제 / 정답 / 해설"을 포함시켜 줘.
        5. 문제 수는 최소 3개 이상 5개 미만으로 해줘.
        6. 사용자 질문이 업로드된 파일과 무관할 경우 "대답할 수 없습니다"라고 답변해.
        7. 마지막 멘트는 다른 문제를 추가로 내드릴까요? 혹은 문제 난이도를 높혀드릴까요? 하고 다음 스텝에 대한 제안을 해줘

        [출력 포맷]
        문제 유형: {question_type}
        문제 1:
        문제:
        정답:
        해설:
        ...
        """)

## 스마트팜 지원계획 QnA
